performance.yml
config:
  environments:
    production:
      target: "https://api.todoist.com/rest/v1"
      phases:
        - duration: 3
          arrivalRate: 1
          name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
  # processor: "./myProcessor.js"
scenarios:
  - flow:
      - log: "The current environment is: {{$environment}}"
      
      #Create a project
      - post:
          url: "/projects"
          json:
            name: "Project from artillery-02"
          capture:
            json: "$.id"
            as: idProject

      #Create a task
      - post:
          url: "/tasks"
          json:
            content: "Task from artillery-02"
            project_id: "{{idProject}}"
          capture:
            json: "$.id"
            as: idTask
      - log: "The task_id is: {{idTask}} to the project_id: {{idProject}}"
      
      # Get an active task
      - get:
          url: "/tasks/{{idTask}}"

      # Get active tasks
      - get:
          url: "/tasks"
      
      # Update a task
      - post:
          url: "/tasks/{{idTask}}"
          json:
            content: "Update a task name"
      - log: "The task name {{idTask}} was updated"

      # Complete task
      - post:
          url: "/tasks/{{idTask}}/close"
      - log: "The task {{idTask}} was closed"

      # Reopen task
      - post:
          url: "/tasks/{{idTask}}/reopen"
      - log: "The task {{idTask}} was reopened"

      # Delete task
      - delete:
          url: "/tasks/{{idTask}}"
      - log: "The task {{idTask}} was deleted"

  # For more information: https://artillery.io/docs/script-reference/