performance.yml
config:
  environments:
    production:
      target: "https://api.todoist.com/rest/v1"
      phases:
        - duration: 6
          arrivalRate: 2
          name: "Phase 1"
      processor: "./generateData.js"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - name: "Create a Project"
    flow:
      - log: "The current environment is: {{ $environment }}"
      
      #Create a project
      - function: "generateProjectData"
      - post:
          url: "/projects"
          json:
            name: "{{ projectName }} "
          capture:
            json: "$.id"
            as: idProject

      #Create a task
      - function: "generateTaskData"
      - post:
          url: "/tasks"
          json:
            content: "{{ taskName }}"
            project_id: "{{ idProject }}"
          capture:
            json: "$.id"
            as: idTask
      - log: "The task_id is: {{ idTask }} to the project_id: {{ idProject }}"
      
      # Get an active task
      - get:
          url: "/tasks/{{idTask}}"

      # Get active tasks
      - get:
          url: "/tasks"
      
      # Update a task
      - function: "generateTaskData"
      - post:
          url: "/tasks/{{idTask}}"
          json:
            content: "{{ updateTaskContent }}"
      - log: "The task name {{ idTask }} was updated"

      # Complete task
      - post:
          url: "/tasks/{{idTask}}/close"
      - log: "The task {{ idTask }} was closed"

      # Reopen task
      - post:
          url: "/tasks/{{idTask}}/reopen"
      - log: "The task {{ idTask }} was reopened"

      # Delete task
      - delete:
          url: "/tasks/{{idTask}}"
      - log: "The task {{ idTask }} was deleted"

      # Delete project
      - delete:
          url: "/projects/{{idProject}}"
      - log: "The project {{ idProject }} was deleted"